export const line = {
  fps: 8,
  frames: ["-", "\\", "|", "/"]
};

export const dots = {
  fps: 12.5,
  frames: ["⠋", "⠙", "⠹", "⠸", "⠼", "⠴", "⠦", "⠧", "⠇", "⠏"]
};

export const scrolling = {
  fps: 5,
  frames: [".  ", ".. ", "...", " ..", "  .", "   "]
};

export const scrolling2 = {
  fps: 2.5,
  frames: [".  ", ".. ", "...", "   "]
};

export const star = {
  fps: 14,
  frames: ["✶", "✸", "✹", "✺", "✹", "✷"]
};

export const ball = {
  fps: 8,
  frames: ["⠁", "⠂", "⠄", "⠂"]
};

export const triangle = {
  fps: 15,
  frames: ["◢", "◣", "◤", "◥"]
};

export const circle = {
  fps: 15,
  frames: ["◐", "◓", "◑", "◒"]
};

export const bounce = {
  fps: 12.5,
  frames: [
    "( ●    )",
    "(  ●   )",
    "(   ●  )",
    "(    ● )",
    "(     ●)",
    "(    ● )",
    "(   ●  )",
    "(  ●   )",
    "( ●    )",
    "(●     )"
  ]
};

export const clock = {
  fps: 10,
  frames: [
    "🕐 ",
    "🕑 ",
    "🕒 ",
    "🕓 ",
    "🕔 ",
    "🕕 ",
    "🕖 ",
    "🕗 ",
    "🕘 ",
    "🕙 ",
    "🕚 "
  ]
};

export const pong = {
  fps: 12.5,
  frames: [
    "▐⠂       ▌",
    "▐⠈       ▌",
    "▐ ⠂      ▌",
    "▐ ⠠      ▌",
    "▐  ⡀     ▌",
    "▐  ⠠     ▌",
    "▐   ⠂    ▌",
    "▐   ⠈    ▌",
    "▐    ⠂   ▌",
    "▐    ⠠   ▌",
    "▐     ⡀  ▌",
    "▐     ⠠  ▌",
    "▐      ⠂ ▌",
    "▐      ⠈ ▌",
    "▐       ⠂▌",
    "▐       ⠠▌",
    "▐       ⡀▌",
    "▐      ⠠ ▌",
    "▐      ⠂ ▌",
    "▐     ⠈  ▌",
    "▐     ⠂  ▌",
    "▐    ⠠   ▌",
    "▐    ⡀   ▌",
    "▐   ⠠    ▌",
    "▐   ⠂    ▌",
    "▐  ⠈     ▌",
    "▐  ⠂     ▌",
    "▐ ⠠      ▌",
    "▐ ⡀      ▌",
    "▐⠠       ▌"
  ]
};
